{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_3",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "input_shape": [48, 48, 1],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer_3"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_15",
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_16",
            "filters": 64,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_12",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_18",
            "rate": 0.25
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_17",
            "filters": 128,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_13",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_19",
            "rate": 0.25
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_18",
            "filters": 512,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_14",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_20",
            "rate": 0.25
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_19",
            "filters": 512,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_15",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_21",
            "rate": 0.25
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_3",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_9",
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_22",
            "rate": 0.25
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_10",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_23",
            "rate": 0.25
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_11",
            "units": 7,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "conv2d_15/kernel",
          "shape": [3, 3, 1, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_15/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_16/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_16/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_17/kernel",
          "shape": [5, 5, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_17/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_18/kernel",
          "shape": [3, 3, 128, 512],
          "dtype": "float32"
        },
        {
          "name": "conv2d_18/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv2d_19/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        {
          "name": "conv2d_19/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "dense_9/kernel",
          "shape": [4608, 256],
          "dtype": "float32"
        },
        {
          "name": "dense_9/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "dense_10/kernel",
          "shape": [256, 512],
          "dtype": "float32"
        },
        {
          "name": "dense_10/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "dense_11/kernel",
          "shape": [512, 7],
          "dtype": "float32"
        },
        {
          "name": "dense_11/bias",
          "shape": [7],
          "dtype": "float32"
        }
      ]
    }
  ]
}
